onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Заявка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_омни_Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_омни_ЗаписьИзБота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Documents/Заявка/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция бит_омни_ДанныеДокументов(HTTPЗапрос) Экспорт
	
	ТипПоиска = HTTPЗапрос.ПараметрыЗапроса.Получить("search_type");
	
	Если ТипПоиска = Неопределено Тогда
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеопределенТипПоиска();	
	ИначеЕсли ТипПоиска = "ByPatient" Тогда                                     
		ИдентификаторПациента = HTTPЗапрос.ПараметрыЗапроса.Получить("patient_id");
		Возврат бит_омни_ЗаявкиПоПациенту(ИдентификаторПациента);
	ИначеЕсли ТипПоиска = "ByID" Тогда
		ИдентификаторПациента = HTTPЗапрос.ПараметрыЗапроса.Получить("appointmentId");
		Возврат бит_омни_ЗаявкаПоUUID(ИдентификаторПациента);
	Иначе	
		Возврат бит_омни_ИнтеграцияСерверСлужебный.НеверныйТипПоиска();	
	КонецЕсли;

КонецФункции

Функция бит_омни_ОбновитьДокумент(HTTPЗапрос) Экспорт

	ТелоЗапроса = бит_омни_ИнтеграцияСервер.ТелоЗапросаВСтруктуру(HTTPЗапрос);
	ИдентификаторДокумента = Неопределено;
	ТелоЗапроса.Свойство("appointmentId", ИдентификаторДокумента);
	
	Заявка = бит_омни_ЗаявкаПоUUID(ИдентификаторДокумента, Истина);
	
	Если ТипЗнч(Заявка) <> Тип("ДокументСсылка.Заявка") Тогда
		Возврат Заявка; // функция может вернуть только HTTPСервисОтвет или ДокументСсылка.Заявка
	КонецЕсли;
	
	Если ТелоЗапроса.Свойство("isApproved") Тогда
		Возврат бит_омни_ПодтвердитьЗаявку(Заявка, ИдентификаторДокумента);	
	КонецЕсли;
	
	Если ТелоЗапроса.Свойство("isCanceled") Тогда
		Возврат бит_омни_ОтменитьЗаявку(Заявка, ИдентификаторДокумента);	
	КонецЕсли;
	
	Возврат бит_омни_СоздатьОбновитьДокумент(HTTPЗапрос, Истина); 

КонецФункции

Функция бит_омни_СоздатьДокумент(HTTPЗапрос) Экспорт
	
	Возврат бит_омни_СоздатьОбновитьДокумент(HTTPЗапрос);  
	
КонецФункции // бит_омни_СоздатьДокумент()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция бит_омни_СоздатьОбновитьДокумент(HTTPЗапрос, Обновление = Ложь)

	ТелоЗапроса = бит_омни_ИнтеграцияСервер.ТелоЗапросаВСтруктуру(HTTPЗапрос);
	
	Клиент = Справочники.Клиенты.бит_омни_ПациентПоUUID(ТелоЗапроса.patient_id, Истина);
	
	Если ТипЗнч(Клиент) <> Тип("СправочникСсылка.Клиенты") Тогда
		Возврат Клиент; // если тип другой, то это HTTPСервисОтвет	
	КонецЕсли;
	
	Сотрудник = Справочники.Сотрудники.бит_омни_СотрудникПоUUID(ТелоЗапроса.doctorId, Истина);
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат Сотрудник; // если тип другой, то это HTTPСервисОтвет	
	КонецЕсли;
	
	Филиал = Справочники.Филиалы.бит_омни_ФилиалПоUUID(ТелоЗапроса.branchId, Истина);
	
	Если ТипЗнч(Филиал) <> Тип("СправочникСсылка.Филиалы") Тогда
		Возврат Филиал; // если тип другой, то это HTTPСервисОтвет	
	КонецЕсли;
	
	Специализация = Справочники.КатегорииВыработки.бит_омни_СпециализацияПоUUID(ТелоЗапроса.specializationId, Истина);
	
	Если ТипЗнч(Специализация) <> Тип("СправочникСсылка.КатегорииВыработки") Тогда
		Возврат Специализация; // если тип другой, то это HTTPСервисОтвет	
	КонецЕсли;
	
	Кабинет = Справочники.Оборудование.бит_омни_ОборудованиеПоUUID(ТелоЗапроса.cabinetId, Истина);
	
	Если ТипЗнч(Кабинет) <> Тип("СправочникСсылка.Оборудование") Тогда
		Кабинет = Справочники.Оборудование.ПустаяСсылка(); // необязательное поле	
	КонецЕсли;

	ДатаНачала = ТелоЗапроса.datetimeBegin;
	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьДату(ДатаНачала, "datetimeBegin", Истина);
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;	
	КонецЕсли;
	
	ДлительностьПриема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ДлительностьПриема");
	ДлительностьПриемааВСекундах = ОбщегоНазначения.ВремяВСекунды(ДлительностьПриема);
	
	Если Обновление Тогда
		ЗаявкаСсылка = бит_омни_ЗаявкаПоUUID(ТелоЗапроса.appointmentId, Истина);
		
		Если ТипЗнч(ЗаявкаСсылка) <> Тип("ДокументСсылка.Заявка") Тогда
			Возврат ЗаявкаСсылка; // если тип другой, то это HTTPСервисОтвет	
		КонецЕсли;
		
		Заявка = ЗаявкаСсылка.ПолучитьОбъект(); 
		Заявка.Работы.Очистить();
	Иначе
		Заявка = Документы.Заявка.СоздатьДокумент();
		Заявка.Дата = ТекущаяДатаСеанса();
		Заявка.Клиент = Клиент;
		Заявка.Кабинет = Кабинет;
		Заявка.бит_омни_Специализация = Специализация;
		Заявка.бит_омни_ЗаписьИзБота = Истина;
		Заявка.Ответственный = Пользователи.ТекущийПользователь();
		Заявка.Состояние = Справочники.ВидыСостоянийЗаявок.Запланирована;
	КонецЕсли;
	
	Заявка.Сотрудник = Сотрудник;
	Заявка.Филиал = Филиал;
	Заявка.ДатаНачала = ДатаНачала;
	Заявка.ВремяНачала = ДатаНачала;
	Заявка.ДатаОкончания = ДатаНачала + ДлительностьПриемааВСекундах;
	Заявка.ВремяОкончания = Заявка.ДатаОкончания;
	ЗаявкаРаботы = Заявка.Работы.Добавить();
	ЗаявкаРаботы.ДатаНачала = Заявка.ДатаНачала;
	ЗаявкаРаботы.ДатаОкончания = Заявка.ДатаОкончания;
	ЗаявкаРаботы.Продолжительность = Дата(1,1,1) + (Заявка.ДатаОкончания - Заявка.ДатаНачала);
	
	Попытка
		Заявка.Записать();
		
		Если НЕ Обновление Тогда
			бит_омни_ЗаписатьПодтверждениеЗаявки(Заявка.Ссылка);
		КонецЕсли;
		
		Возврат бит_омни_ЗаявкаПоUUID(Строка(Заявка.Ссылка.УникальныйИдентификатор()));
	Исключение
		Ошибки = Новый Массив;
		Ошибки.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Для Каждого Сообщение Из Сообщения Цикл
			Ошибки.Добавить(Сообщение.Текст);
		КонецЦикла;
		
		Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("couldnt_appointment", 400, СтрСоединить(Ошибки, Символы.ПС));
	КонецПопытки;

КонецФункции // бит_омни_СоздатьОбновитьДокумент()


Функция бит_омни_ЗаявкиПоПациенту(ИдентификаторПациента) Экспорт
	
	Если ИдентификаторПациента = Неопределено Тогда
		Возврат Справочники.Клиенты.бит_омни_НеопределенИдентификатор();
	КонецЕсли;	                                                        
	
	Клиент = Справочники.Клиенты.бит_омни_ПациентПоUUID(ИдентификаторПациента, Истина);
	
	Если ТипЗнч(Клиент) <> Тип("СправочникСсылка.Клиенты") Тогда
		Возврат Клиент; // функция может вернуть только HTTPСервисОтвет или СправочникСсылка.Клиенты
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("Клиент", Клиент);
	ПараметрыПоиска.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	ПараметрыПоиска.Вставить("СостояниеОтмена", Справочники.ВидыСостоянийЗаявок.Отменена);
	
	УсловиеПоиска = "
	|	НЕ ЗаявкаРаботы.Ссылка.ПометкаУдаления
	|	И ЗаявкаРаботы.Ссылка.Состояние <> &СостояниеОтмена
	|	И ЗаявкаРаботы.Ссылка.Состояние.ТипСостояния <> ЗНАЧЕНИЕ(Перечисление.ТипыСостоянийЗаявок.Отменена)
	|	И ЗаявкаРаботы.Ссылка.Клиент = &Клиент
	|	И ЗаявкаРаботы.Ссылка.ДатаНачала >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)";
	ДанныеИзЗапроса = бит_омни_ПолучитьДанныеЗаявок(ПараметрыПоиска, УсловиеПоиска, 100);
	
	ТелоЗапроса = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеИзЗапроса);
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоЗапроса);

КонецФункции

Функция бит_омни_ЗаявкаПоUUID(Знач ИдентификаторДокумента, ВернутьСсылку = Ложь) Экспорт
	
	РезультатПроверки = бит_омни_ИнтеграцияСервер.ВалидироватьИдентификатор(ИдентификаторДокумента, "appointmentId");
	
	Если РезультатПроверки <> Неопределено Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Заявка = ПолучитьСсылку(ИдентификаторДокумента);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Заявка) Тогда
		Возврат бит_омни_НеНайденаЗаявка();
	КонецЕсли;
	
	Если ВернутьСсылку Тогда
		Возврат Заявка;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("Ссылка", Заявка);
	
	УсловиеПоиска = "
	|	ЗаявкаРаботы.Ссылка = &Ссылка";
	ДанныеИзЗапроса = бит_омни_ПолучитьДанныеЗаявок(ПараметрыПоиска, УсловиеПоиска, 1);
	
	ТелоЗапроса = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеИзЗапроса);	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоЗапроса.Получить(0));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция бит_омни_НеверныйИдентификатор()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("invalid_appointmentId");	

КонецФункции

Функция бит_омни_НеНайденаЗаявка()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("appointment_not_found", 404);	

КонецФункции

Функция бит_омни_ПодтверждениеЗаписиНедоступно()

	Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("approving_not_supported", 404);	

КонецФункции


Функция бит_омни_ПолучитьДанныеЗаявок(ПараметрыПоиска, УсловиеПоиска, Лимит = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Лимит КАК Лимит,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА Заявка.Сотрудник
	|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	|	КОНЕЦ КАК Врач,
	|	ЗаявкаРаботы.ДатаНачала КАК ВремяНачала,
	|	ЗаявкаРаботы.Ссылка КАК Ссылка,
	|	НАЧАЛОПЕРИОДА(ЗаявкаРаботы.Ссылка.ДатаНачала, ДЕНЬ) КАК Дата,
	|	Заявка.Клиент КАК Клиент,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Оборудование1 <> ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|			ТОГДА ЗаявкаРаботы.Оборудование1
	|		ИНАЧЕ Заявка.Кабинет
	|	КОНЕЦ КАК Кабинет,
	|	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	|	Заявка.Филиал КАК Филиал,
	|	Заявка.Состояние КАК Состояние,
	|	&Подтверждена КАК Подтверждена
	|ПОМЕСТИТЬ ДанныеПоЗаявкам
	|ИЗ
	|	Документ.Заявка.Работы КАК ЗаявкаРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
	|		ПО ЗаявкаРаботы.Ссылка = Заявка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО &УсловиеСвязиСвойстваОбъектов
	|ГДЕ
	|	&ТекстУсловия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Врач)) КАК doctorId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПоЗаявкам.Врач) КАК doctorTitle,
	|	СпрСотрудники.Фамилия КАК doctorLastname,
	|	СпрСотрудники.Имя КАК doctorFirstname,
	|	СпрСотрудники.Отчество КАК doctorPatronimic,
	|	ДанныеПоЗаявкам.ВремяНачала КАК datetimeBegin,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Ссылка)) КАК appointment_id,
	|	ДанныеПоЗаявкам.Дата КАК appointment_date,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Клиент)) КАК patient_id,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Кабинет)) КАК cabinetId,
	|	ВЫБОР
	|		КОГДА ДанныеПоЗаявкам.Кабинет = ЗНАЧЕНИЕ(Справочник.Оборудование.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПоЗаявкам.Кабинет)
	|	КОНЕЦ КАК cabinetTitle,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Номенклатура)) КАК serviceId,
	|	ВЫБОР
	|		КОГДА ДанныеПоЗаявкам.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПоЗаявкам.Номенклатура)
	|	КОНЕЦ КАК serviceTitle,
	|	ВЫБОР
	|		КОГДА ДанныеПоЗаявкам.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СпрНоменклатура.КатегорияВыработки))
	|		ИНАЧЕ ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СпрСотрудники.Специализация)), ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЗНАЧЕНИЕ(Справочник.КатегорииВыработки.ПустаяСсылка))))
	|	КОНЕЦ КАК specializationId,
	|	ВЫБОР
	|		КОГДА ДанныеПоЗаявкам.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(СпрНоменклатура.КатегорияВыработки)
	|		ИНАЧЕ ЕСТЬNULL(ПРЕДСТАВЛЕНИЕССЫЛКИ(СпрСотрудники.Специализация), НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК specializationTitle,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Филиал)) КАК branchId,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПоЗаявкам.Филиал) КАК branchTitle,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВидыСостоянийЗаявок.бит_омни_ЗаголовокДляВыгрузки, """") <> """"
	|			ТОГДА ВидыСостоянийЗаявок.бит_омни_ЗаголовокДляВыгрузки
	|		КОГДА ЕСТЬNULL(ВидыСостоянийЗаявок.ИмяПредопределенныхДанных, """") <> """"
	|			ТОГДА ВидыСостоянийЗаявок.ИмяПредопределенныхДанных
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПоЗаявкам.Состояние)
	|	КОНЕЦ КАК conditionTitle,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДанныеПоЗаявкам.Состояние)) КАК conditionId,
	|	ДанныеПоЗаявкам.Подтверждена КАК isApproved
	|ИЗ
	|	ДанныеПоЗаявкам КАК ДанныеПоЗаявкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СпрСотрудники
	|		ПО ДанныеПоЗаявкам.Врач = СпрСотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ДанныеПоЗаявкам.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыСостоянийЗаявок КАК ВидыСостоянийЗаявок
	|		ПО ДанныеПоЗаявкам.Состояние = ВидыСостоянийЗаявок.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	datetimeBegin";
	
	Если ЗначениеЗаполнено(УсловиеПоиска) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловия", УсловиеПоиска);
	Иначе
		Запрос.УстановитьПараметр("ТекстУсловия", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Лимит) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Лимит КАК Лимит,", СтрШаблон("ПЕРВЫЕ %1", Формат(Лимит, "ЧГ=")));
	КонецЕсли;
	
	ПризнакПодтвержденнойЗаявки = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПризнакПодтвержденнойЗаявки");
	Если НЕ ЗначениеЗаполнено(ПризнакПодтвержденнойЗаявки) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Подтверждена", "Неопределено");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСвязиСвойстваОбъектов", "ЛОЖЬ");
	ИначеЕсли ТипЗнч(ПризнакПодтвержденнойЗаявки) = Тип("СправочникСсылка.ВидыСостоянийЗаявок") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Подтверждена", "Заявка.Состояние = &СостояниеПодтверждена");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСвязиСвойстваОбъектов", "ЛОЖЬ");
		Запрос.УстановитьПараметр("СостояниеПодтверждена", ПризнакПодтвержденнойЗаявки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Подтверждена", "ЗначенияСвойствОбъектов.Значение = ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСвязиСвойстваОбъектов", 
			"ЗаявкаРаботы.Ссылка = ЗначенияСвойствОбъектов.Объект
			|	И ЗначенияСвойствОбъектов.Свойство = &СвойствоПодтверждена");
		Запрос.УстановитьПараметр("СвойствоПодтверждена", ПризнакПодтвержденнойЗаявки);
	КонецЕсли;
	
	Для Каждого ПараметрПоиска Из ПараметрыПоиска Цикл
		Запрос.УстановитьПараметр(ПараметрПоиска.Ключ, ПараметрПоиска.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеИзЗапроса = РезультатЗапроса.Выгрузить();
	Возврат ДанныеИзЗапроса;

КонецФункции

Функция бит_омни_ПодтвердитьЗаявку(Заявка, ИдентификаторДокумента)
	
	ПризнакПодтвержденнойЗаявки = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПризнакПодтвержденнойЗаявки");
	Если НЕ ЗначениеЗаполнено(ПризнакПодтвержденнойЗаявки) Тогда
		Возврат бит_омни_ПодтверждениеЗаписиНедоступно();		
	КонецЕсли;
	
	ТелоЗапроса = Новый Структура("appointmentId, isApproved", ИдентификаторДокумента, Истина);
	Попытка
		бит_омни_ЗаписатьПодтверждениеЗаявки(Заявка, ПризнакПодтвержденнойЗаявки);
	Исключение                                          
		Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("couldnt_approve", 500, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоЗапроса);
	
КонецФункции

Процедура бит_омни_ЗаписатьПодтверждениеЗаявки(Заявка, ПризнакПодтвержденнойЗаявки = Неопределено)
	
	ПризнакПодтвержденнойЗаявки = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПризнакПодтвержденнойЗаявки");
	Если НЕ ЗначениеЗаполнено(ПризнакПодтвержденнойЗаявки) Тогда
		Возврат;		
	КонецЕсли;
	
	Если ТипЗнч(ПризнакПодтвержденнойЗаявки) = Тип("СправочникСсылка.ВидыСостоянийЗаявок") Тогда
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		ЗаявкаОбъект.Состояние = ПризнакПодтвержденнойЗаявки;
		ЗаявкаОбъект.Записать();
	Иначе
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		Запись.Объект	= Заявка;
		Запись.Свойство	= ПризнакПодтвержденнойЗаявки;
		Запись.Значение = Истина;
		Запись.Записать();
	КонецЕсли;

КонецПроцедуры

Функция бит_омни_ОтменитьЗаявку(Заявка, ИдентификаторДокумента)
	
	ПризнакПодтвержденнойЗаявки = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПризнакПодтвержденнойЗаявки");
	Если НЕ ЗначениеЗаполнено(ПризнакПодтвержденнойЗаявки) Тогда
		Возврат бит_омни_ПодтверждениеЗаписиНедоступно();		
	КонецЕсли;
	
	ТелоЗапроса = Новый Структура("appointmentId, isCanceled", ИдентификаторДокумента, Истина);
	
	Попытка
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		ЗаявкаОбъект.ОтменитьЗаявку(Ложь);
	Исключение                                          
		Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("couldnt_approve", 500, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	 	
	Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(ТелоЗапроса);
	
КонецФункции

#КонецОбласти
